src/cf/Documents/уатЗаправкаГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатЗаправкаГСМ</Name>
			<BasedOn>
				<xr:Item>Document.уатПутевойЛист</xr:Item>
				<xr:Item>Document.уатТехнологическийПутевойЛист</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатОстаткиГСМнаТС</xr:Item>
				<xr:Item>AccumulationRegister.уатОстаткиТЖнаТС</xr:Item>
				<xr:Item>AccumulationRegister.уатПартииТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.уатОборотыПоЗаправкамГСМ</xr:Item>
				<xr:Item>AccumulationRegister.уатОборотыТЖнаТС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АЗС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатАЗС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияГСМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыДвиженияГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатТехнологическийПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДокумента</Name>
					<Comment>Количество документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщееКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Транзакция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заправки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Comment>Транспортное средство или оборудование</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГСМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Водитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПластиковаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПластиковыеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутевойЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
								<v8:Type>cfg:DocumentRef.уатТехнологическийПутевойЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Плотность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомераТалонов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоЗаправкаЭлектричества</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/уатПартииТоваровНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатПартииТоваровНаСкладах</Name>
			<Comment>Партии товаров на складах  (уат)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Comment>Стоимость в валюте регламентированного учета без НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьУпр</Name>
					<Comment>Стоимость в валюте управленческого учета без НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в регл. валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.уатВводОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.уатАвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.уатОперацииСТехническимиЖидкостями</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСливГСМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатНоменклатураГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатНоменклатураГСМ</Name>
			<Comment>Доп. сведения для ГСМ</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВестиУчетОстатковТЖ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаГСМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатГруппыГСМ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГСМТалона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛитровыйТалон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоминалТалона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Плотность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатВидыДвиженияГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыДвиженияГСМ</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаправкаНаличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаправкаПластиковаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаправкаПластиковаяКартаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаправкаПоставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаправкаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаправкаТалоны</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеПЛ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатЗаправкаГСМ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "Реестр";
	КомандаПечати.Представление  = НСтр("en='Document register';ru='Реестр документов'");
	КомандаПечати.ЗаголовокФормы = НСтр("en='Register of documents ""Fueling""';ru='Реестр документов ""Заправка ГСМ""'");
	КомандаПечати.Обработчик     = "уатОбщегоНазначенияТиповыеКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм     = "ФормаСписка";
	КомандаПечати.Порядок        = 100;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если НЕ уатОбщегоНазначенияСервер.РазрешениеПечатиНепроведенногоДокумента(МассивОбъектов) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	уатОбщегоНазначенияСервер.УстановитьРедактированиеПечатныхФормДокумента(КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ПодразделениеОрганизации)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВариантыОтчетов

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	СформироватьТаблицаГСМ(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаТЖ(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОборотыГСМ(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОборотыТЖ(ДокументСсылка, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Выполняет контроль корректности движений документа.
//
Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ДокументСсылка);
	
	Если (ДокументСсылка.ВидДвиженияГСМ = Перечисления.уатВидыДвиженияГСМ.ЗаправкаСклад
		ИЛИ ДокументСсылка.ВидДвиженияГСМ = Перечисления.уатВидыДвиженияГСМ.ЗаправкаТалоны
		ИЛИ ДокументСсылка.ВидДвиженияГСМ = Перечисления.уатВидыДвиженияГСМ.ЗаправкаПластиковаяКартаСклад)
		И ДокументСсылка.Заправки.Количество() > 0 Тогда
		
		ТаблицаДат = Новый ТаблицаЗначений;
		ТаблицаДат.Колонки.Добавить("Дата");
		ТаблицаДат.Колонки.Добавить("ГСМ");
		Для каждого ТекСтрокаЗаправка ИЗ ДокументСсылка.Заправки Цикл
			НовСтрока = ТаблицаДат.Добавить();
			НовСтрока.Дата = ТекСтрокаЗаправка.Дата;
			НовСтрока.ГСМ = ТекСтрокаЗаправка.ГСМ;
		КонецЦикла;
		
		мЗапрос = Новый Запрос;
		
		СчетчикДат = 1;
		Для каждого ТекДата ИЗ ТаблицаДат Цикл
			МоментКонтроля = Новый Граница(ТекДата.Дата, ВидГраницы.Включая);
			УчетПартийПоОрганизациям = уатОбщегоНазначения.УчетнаяПолитика(ДокументСсылка.Организация,
				МоментКонтроля).УчетПартийПоОрганизациям;
				
			Если СчетчикДат <> 1 тогда
				мЗапрос.Текст = мЗапрос.Текст + "
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|";
			КонецЕсли;
			
			мЗапрос.Текст = мЗапрос.Текст + "
			|ВЫБРАТЬ
			|	&Дата" + СчетчикДат + " КАК Дата,
			|	уатПартииТоваровНаСкладах.Номенклатура КАК Номенклатура,
			|	ЕСТЬNULL(уатПартииТоваровНаСкладах.КоличествоОстаток, 0) КАК КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.уатПартииТоваровНаСкладах.Остатки(&ДатаГр" + СчетчикДат
			+ ", Склад = &Склад И Номенклатура = &Номенклатура" + СчетчикДат
			+ ?(УчетПартийПоОрганизациям, " И Организация = &Организация", "") + ") КАК уатПартииТоваровНаСкладах
			|ГДЕ
			|	ЕСТЬNULL(уатПартииТоваровНаСкладах.КоличествоОстаток, 0) < 0";
			мЗапрос.УстановитьПараметр("ДатаГр" + СчетчикДат, МоментКонтроля);
			мЗапрос.УстановитьПараметр("Дата" + СчетчикДат, ТекДата.Дата);
			мЗапрос.УстановитьПараметр("Номенклатура" + СчетчикДат, ТекДата.ГСМ);
			
			СчетчикДат = СчетчикДат + 1;
		КонецЦикла;
		
		мЗапрос.УстановитьПараметр("Склад", ДокументСсылка.АЗС.Контрагент_Склад);
		мЗапрос.УстановитьПараметр("Организация", ДокументСсылка.Организация);
				
		Рез = мЗапрос.Выполнить().Выбрать();
		
		Пока Рез.Следующий() Цикл
			ТекстНСТР = НСтр("en='Negative balance of products and services ""%1"" at warehouse ""%2"" for date %3: %4';ru='Отрицательный остаток номенклатуры ""%1"" на складе ""%2"" на дату %3: %4'");
			ТекстНСТР = СтрШаблон(ТекстНСТР, Рез.Номенклатура, ДокументСсылка.АЗС.Контрагент_Склад, Рез.Дата, Рез.КоличествоОстаток);
			уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, Отказ, Заголовок);
			ЗаписьЖурналаРегистрации("Документ. Проведение",
				УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.Документы.уатЗаправкаГСМ,
				ДокументСсылка,
				ТекстНСТР);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Получает дополнительные реквизиты для отображения в отчете "Реестр документов"
// 
// Возвращаемое значение:
//   Структура доп. реквизитов
//
Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура("Информация", "АЗС");
	Возврат Результат;
	
КонецФункции

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокументаПоПартиям(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Если ДокументСсылка.ВидДвиженияГСМ = Перечисления.уатВидыДвиженияГСМ.ЗаправкаСклад
		ИЛИ ДокументСсылка.ВидДвиженияГСМ = Перечисления.уатВидыДвиженияГСМ.ЗаправкаТалоны
		ИЛИ ДокументСсылка.ВидДвиженияГСМ = Перечисления.уатВидыДвиженияГСМ.ЗаправкаПластиковаяКартаСклад Тогда
		
		СформироватьТаблицаПартий(ДокументСсылка, СтруктураДополнительныеСвойства);
	КонецЕсли;
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПартий(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	ТаблицаГСМДата = Новый ТаблицаЗначений;
	ТаблицаГСМДата.Колонки.Добавить("Склад"       , Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТаблицаГСМДата.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	//ТаблицаГСМДата.Колонки.Добавить("Количество"  , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ТаблицаГСМДата.Колонки.Добавить("Количество"  , Новый ОписаниеТипов("Число"));

	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДокумента.Ссылка КАК Регистратор,
	|	ТаблицаДокумента.Дата КАК Период,
	|	ТаблицаДокумента.Ссылка.АЗС.Контрагент_Склад КАК Склад,
	|	ТаблицаДокумента.ГСМ КАК Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаДокумента.Плотность = 0
	|				ТОГДА ТаблицаДокумента.Количество
	|			ИНАЧЕ ТаблицаДокумента.Количество * ТаблицаДокумента.Плотность
	|		КОНЕЦ) КАК Количество
	|ИЗ
	|	Документ.уатЗаправкаГСМ.Заправки КАК ТаблицаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
	|		ПО ТаблицаДокумента.ГСМ = уатНоменклатураГСМ.Номенклатура
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И ВЫБОР
	|			КОГДА уатНоменклатураГСМ.ГруппаГСМ <> ЗНАЧЕНИЕ(Перечисление.уатГруппыГСМ.Электроэнергия)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ уатНоменклатураГСМ.ВестиУчетОстатковТЖ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.ГСМ,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Ссылка.АЗС.Контрагент_Склад,
	|	ТаблицаДокумента.Ссылка,
	|	уатНоменклатураГСМ.ГруппаГСМ,
	|	уатНоменклатураГСМ.ГСМТалона
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период
	|ИТОГИ ПО
	|	Период";
	мЗапрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	ВыборкаГСМ = мЗапрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТаблицаПартии = Неопределено;
	Пока ВыборкаГСМ.Следующий() Цикл
		ВыборкаГруппировкаДата = ВыборкаГСМ.Выбрать();
		ТаблицаГСМДата.Очистить();
		Пока ВыборкаГруппировкаДата.Следующий() Цикл
			НовСтрока = ТаблицаГСМДата.Добавить();
			НовСтрока.Склад        = ВыборкаГруппировкаДата.склад;
			НовСтрока.Номенклатура = ВыборкаГруппировкаДата.Номенклатура;
			НовСтрока.Количество   = ВыборкаГруппировкаДата.Количество;
		КонецЦикла;
		мМоментВремениПартий = Новый Граница(ВыборкаГСМ.Период, ВидГраницы.Включая);
		
		ТаблицаПартий = уатПроведение.ПолучитьТаблицуПартийДляСписания(
			ТаблицаГСМДата,
			мМоментВремениПартий,
			ДокументСсылка.Организация);
		
		ЗапросПартии = Новый Запрос();
		ЗапросПартии.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТабДанных.Организация КАК Организация,
		|	ТабДанных.Склад КАК Склад,
		|	ТабДанных.Номенклатура КАК Номенклатура,
		|	ТабДанных.Партия КАК Партия,
		|	ТабДанных.Количество КАК Количество,
		|	ТабДанных.Стоимость КАК Стоимость,
		|	ТабДанных.СтоимостьУпр КАК СтоимостьУпр,
		|	ТабДанных.СуммаНДС КАК СуммаНДС
		|ПОМЕСТИТЬ ВремТаблицаПартий
		|ИЗ
		|	&ТаблицаПарам КАК ТабДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&Период КАК Период,
		|	&Регистратор КАК Регистратор,
		|	ТабДанных.Организация КАК Организация,
		|	ТабДанных.Склад КАК Склад,
		|	ТабДанных.Партия КАК Партия,
		|	ТабДанных.Номенклатура КАК Номенклатура,
		|	ТабДанных.Количество КАК Количество,
		|	ТабДанных.Стоимость КАК Стоимость,
		|	ТабДанных.СтоимостьУпр КАК СтоимостьУпр,
		|	ТабДанных.СуммаНДС КАК СуммаНДС
		|ИЗ
		|	ВремТаблицаПартий КАК ТабДанных";
		
		ЗапросПартии.УстановитьПараметр("Период"      , ВыборкаГСМ.Период);
		ЗапросПартии.УстановитьПараметр("ТаблицаПарам", ТаблицаПартий);
		ЗапросПартии.УстановитьПараметр("Регистратор" , ДокументСсылка);
		
		МассивРезультатов = ЗапросПартии.ВыполнитьПакет();
		ТаблицаДвижений = МассивРезультатов[1].Выгрузить();
		
		Если ТаблицаПартии = Неопределено Тогда
			ТаблицаПартии = ТаблицаДвижений.Скопировать();
		Иначе
			Для Каждого ТекСтрока Из ТаблицаДвижений Цикл
				НоваяСтрока = ТаблицаПартии.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартии", ТаблицаПартии);
	
КонецПроцедуры // СформироватьТаблицаПартий()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаГСМ(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	// получим результат запроса по товарной таблице
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатЗаправкаГСМЗаправки.ТС КАК ТС,
	|	уатЗаправкаГСМЗаправки.Ссылка.Организация КАК Организация,
	|	уатЗаправкаГСМЗаправки.Ссылка.ПодразделениеОрганизации КАК Подразделение,
	|	уатЗаправкаГСМЗаправки.Ссылка.Колонна КАК Колонна,
	|	ВЫБОР
	|		КОГДА уатНоменклатураГСМ.ГруппаГСМ = &ГруппаГСМТалоны
	|			ТОГДА уатНоменклатураГСМ.ГСМТалона
	|		ИНАЧЕ уатНоменклатураГСМ.Номенклатура
	|	КОНЕЦ КАК ГСМ,
	|	уатНоменклатураГСМ.ГруппаГСМ КАК ГруппаГСМ,
	|	уатЗаправкаГСМЗаправки.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА уатЗаправкаГСМЗаправки.Ссылка.ВидДвиженияГСМ = ЗНАЧЕНИЕ(Перечисление.уатВидыДвиженияГСМ.ЗаправкаСклад)
	|				ИЛИ уатЗаправкаГСМЗаправки.Ссылка.ВидДвиженияГСМ = ЗНАЧЕНИЕ(Перечисление.уатВидыДвиженияГСМ.ЗаправкаПластиковаяКартаСклад)
	|				ИЛИ уатЗаправкаГСМЗаправки.Ссылка.ВидДвиженияГСМ = ЗНАЧЕНИЕ(Перечисление.уатВидыДвиженияГСМ.ЗаправкаТалоны)
	|			ТОГДА уатЗаправкаГСМЗаправки.Сумма
	|		КОГДА уатЗаправкаГСМЗаправки.Ссылка.СуммаВключаетНДС
	|			ТОГДА уатЗаправкаГСМЗаправки.Сумма - уатЗаправкаГСМЗаправки.СуммаНДС
	|		ИНАЧЕ уатЗаправкаГСМЗаправки.Сумма
	|	КОНЕЦ КАК Сумма,
	|	уатЗаправкаГСМЗаправки.СуммаНДС КАК СуммаНДС,
	|	уатЗаправкаГСМЗаправки.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА уатЗаправкаГСМЗаправки.ПутевойЛист <> ЗНАЧЕНИЕ(Документ.уатПутевойЛист.ПустаяСсылка)
	|				И уатЗаправкаГСМЗаправки.Дата < уатЗаправкаГСМЗаправки.ПутевойЛист.ДатаВыезда
	|			ТОГДА уатЗаправкаГСМЗаправки.ПутевойЛист.ДатаВыезда
	|		ИНАЧЕ ВЫБОР
	|				КОГДА уатЗаправкаГСМЗаправки.ПутевойЛист <> ЗНАЧЕНИЕ(Документ.уатПутевойЛист.ПустаяСсылка)
	|						И уатЗаправкаГСМЗаправки.ПутевойЛист.ДатаВозвращения <> ДАТАВРЕМЯ(1, 1, 1)
	|						И уатЗаправкаГСМЗаправки.Дата > уатЗаправкаГСМЗаправки.ПутевойЛист.ДатаВозвращения
	|					ТОГДА уатЗаправкаГСМЗаправки.ПутевойЛист.ДатаВозвращения
	|				ИНАЧЕ уатЗаправкаГСМЗаправки.Дата
	|			КОНЕЦ
	|	КОНЕЦ КАК Дата,
	|	уатЗаправкаГСМЗаправки.Дата КАК ДатаЗаправки,
	|	уатЗаправкаГСМЗаправки.ПутевойЛист КАК ПутевойЛист,
	|	уатЗаправкаГСМЗаправки.ПластиковаяКарта КАК ПластиковаяКарта,
	|	уатЗаправкаГСМЗаправки.Ссылка.АЗС КАК АЗС,
	|	уатЗаправкаГСМЗаправки.Ссылка.ВидДвиженияГСМ КАК ВидДвиженияГСМ,
	|	уатЗаправкаГСМЗаправки.ГСМ КАК ГСМ1
	|ИЗ
	|	Документ.уатЗаправкаГСМ.Заправки КАК уатЗаправкаГСМЗаправки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
	|		ПО уатЗаправкаГСМЗаправки.ГСМ = уатНоменклатураГСМ.Номенклатура
	|			И (уатНоменклатураГСМ.ГруппаГСМ <> &ГруппаГСМТЖ)
	|ГДЕ
	|	уатЗаправкаГСМЗаправки.Ссылка = &Ссылка
	|	И ВЫБОР
	|			КОГДА уатНоменклатураГСМ.ГруппаГСМ <> ЗНАЧЕНИЕ(Перечисление.уатГруппыГСМ.Электроэнергия)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ уатНоменклатураГСМ.ВестиУчетОстатковТЖ
	|		КОНЕЦ");
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ГруппаГСМТалоны", Перечисления.уатГруппыГСМ.Талон);
	Запрос.УстановитьПараметр("ГруппаГСМТЖ", Перечисления.уатГруппыГСМ.ПрисадкиИТехническиеЖидкости);
	
	тблГСМ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекСтрока Из тблГСМ Цикл
		Если ТекСтрока.ГруппаГСМ = Перечисления.уатГруппыГСМ.Талон Тогда
			ТекСтрока.Количество = уатОбщегоНазначения.уатКоличествоЛитровТалонаГСМ(ТекСтрока.Дата, ТекСтрока.АЗС, ТекСтрока.ГСМ1, ТекСтрока.Количество);
		КонецЕсли;	
	КонецЦикла;
	
	// округляем до точности хранения остатков ГСМ в ТС
	мТочностьОстатковГСМ = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ДокументСсылка.Организация, ПланыВидовХарактеристик.уатПраваИНастройки.ТочностьОстатковТоплива);
	Для Каждого ТекСтрока Из тблГСМ Цикл
		ТекСтрока.Количество = Окр(ТекСтрока.Количество, мТочностьОстатковГСМ);
	КонецЦикла;
	
	тблГСМ.Колонки.Добавить("ВидДвижения");
	тблГСМ.Колонки.Добавить("Партия");
	тблГСМ.Колонки.Добавить("Регистратор");
	тблГСМ.Колонки.Добавить("Стоимость");
	тблГСМ.Колонки.Добавить("СтоимостьУпр");
	тблГСМ.Колонки.Дата.Имя = "Период";
		
	УчетнаяПолитика = уатОбщегоНазначения.УчетнаяПолитика(ДокументСсылка.Организация, ДокументСсылка.Дата);
	Если УчетнаяПолитика.СпособОценкиМПЗ <> Перечисления.СпособыОценки.ПоСредней Тогда
		ТекПартия = ДокументСсылка;
	Иначе
		ТекПартия = Неопределено;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из тблГСМ Цикл
		ТекСтрока.Регистратор = ДокументСсылка;
		ТекСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
		ТекСтрока.Партия = ТекПартия;
		
		КурсКратностьВалютыСтроки = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(
			ТекСтрока.Валюта, ТекСтрока.ДатаЗаправки, ДокументСсылка);
		КурсКратностьВалютыРегл = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(
			СтруктураДополнительныеСвойства.ВалютаРеглУчета, ТекСтрока.ДатаЗаправки, ДокументСсылка);
		КурсКратностьВалютыУпр = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(
			СтруктураДополнительныеСвойства.ВалютаУпрУчета,	ТекСтрока.ДатаЗаправки, ДокументСсылка);
			
		ТекСтрока.Стоимость = ТекСтрока.Сумма;
		ТекСтрока.СтоимостьУпр = ТекСтрока.Сумма;
		
		Если ТекСтрока.Стоимость <> 0 И СтруктураДополнительныеСвойства.ВалютаРеглУчета <> ТекСтрока.Валюта Тогда
			ТекСтрока.Стоимость = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Стоимость,
				ТекСтрока.Валюта,                    СтруктураДополнительныеСвойства.ВалютаРеглУчета,
				КурсКратностьВалютыСтроки.Курс,      КурсКратностьВалютыРегл.Курс,
				КурсКратностьВалютыСтроки.Кратность, КурсКратностьВалютыРегл.Кратность,,
				ДокументСсылка);
		КонецЕсли;
		Если ТекСтрока.СтоимостьУпр <> 0 И СтруктураДополнительныеСвойства.ВалютаУпрУчета <> ТекСтрока.Валюта Тогда
			ТекСтрока.СтоимостьУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СтоимостьУпр,
				ТекСтрока.Валюта,                    СтруктураДополнительныеСвойства.ВалютаУпрУчета,
				КурсКратностьВалютыСтроки.Курс,      КурсКратностьВалютыУпр.Курс,
				КурсКратностьВалютыСтроки.Кратность, КурсКратностьВалютыУпр.Кратность,,
				ДокументСсылка);
		КонецЕсли;
		Если ТекСтрока.СуммаНДС <> 0 И СтруктураДополнительныеСвойства.ВалютаРеглУчета <> ТекСтрока.Валюта Тогда
			ТекСтрока.СуммаНДС = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаНДС,
				ТекСтрока.Валюта,                    СтруктураДополнительныеСвойства.ВалютаРеглУчета,
				КурсКратностьВалютыСтроки.Курс,      КурсКратностьВалютыРегл.Курс,
				КурсКратностьВалютыСтроки.Кратность, КурсКратностьВалютыРегл.Кратность,,
				ДокументСсылка);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаГСМ", тблГСМ);
	
КонецПроцедуры // СформироватьТаблицаГСМ()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаТЖ(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	// получим результат запроса по товарной таблице
	Запрос = Новый Запрос();
	ТекстЗапроса=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатЗаправкаГСМЗаправки.ТС КАК ТС,
	|	уатЗаправкаГСМЗаправки.Ссылка.Организация КАК Организация,
	|	уатЗаправкаГСМЗаправки.Ссылка.ПодразделениеОрганизации КАК Подразделение,
	|	уатЗаправкаГСМЗаправки.Ссылка.Колонна КАК Колонна,
	|	уатНоменклатураГСМ.Номенклатура КАК ТЖ,
	|	уатЗаправкаГСМЗаправки.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА уатЗаправкаГСМЗаправки.Ссылка.ВидДвиженияГСМ = ЗНАЧЕНИЕ(Перечисление.уатВидыДвиженияГСМ.ЗаправкаСклад)
	|				ИЛИ уатЗаправкаГСМЗаправки.Ссылка.ВидДвиженияГСМ = ЗНАЧЕНИЕ(Перечисление.уатВидыДвиженияГСМ.ЗаправкаПластиковаяКартаСклад)
	|				ИЛИ уатЗаправкаГСМЗаправки.Ссылка.ВидДвиженияГСМ = ЗНАЧЕНИЕ(Перечисление.уатВидыДвиженияГСМ.ЗаправкаТалоны)
	|			ТОГДА уатЗаправкаГСМЗаправки.Сумма
	|		КОГДА уатЗаправкаГСМЗаправки.Ссылка.СуммаВключаетНДС
	|			ТОГДА уатЗаправкаГСМЗаправки.Сумма - уатЗаправкаГСМЗаправки.СуммаНДС
	|		ИНАЧЕ уатЗаправкаГСМЗаправки.Сумма
	|	КОНЕЦ КАК Сумма,
	|	уатЗаправкаГСМЗаправки.СуммаНДС КАК СуммаНДС,
	|	уатЗаправкаГСМЗаправки.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА уатЗаправкаГСМЗаправки.ПутевойЛист <> ЗНАЧЕНИЕ(Документ.уатПутевойЛист.ПустаяСсылка)
	|				И уатЗаправкаГСМЗаправки.Дата < уатЗаправкаГСМЗаправки.ПутевойЛист.ДатаВыезда
	|			ТОГДА уатЗаправкаГСМЗаправки.ПутевойЛист.ДатаВыезда
	|		ИНАЧЕ ВЫБОР
	|				КОГДА уатЗаправкаГСМЗаправки.ПутевойЛист <> ЗНАЧЕНИЕ(Документ.уатПутевойЛист.ПустаяСсылка)
	|						И уатЗаправкаГСМЗаправки.ПутевойЛист.ДатаВозвращения <> ДАТАВРЕМЯ(1, 1, 1)
	|						И уатЗаправкаГСМЗаправки.Дата > уатЗаправкаГСМЗаправки.ПутевойЛист.ДатаВозвращения
	|					ТОГДА уатЗаправкаГСМЗаправки.ПутевойЛист.ДатаВозвращения
	|				ИНАЧЕ уатЗаправкаГСМЗаправки.Дата
	|			КОНЕЦ
	|	КОНЕЦ КАК Дата,
	|	уатЗаправкаГСМЗаправки.Дата КАК ДатаЗаправки
	|ИЗ
	|	Документ.уатЗаправкаГСМ.Заправки КАК уатЗаправкаГСМЗаправки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
	|		ПО уатЗаправкаГСМЗаправки.ГСМ = уатНоменклатураГСМ.Номенклатура
	|			И (уатНоменклатураГСМ.ВестиУчетОстатковТЖ)
	|			И (уатНоменклатураГСМ.ГруппаГСМ = &ГруппаГСМТЖ)
	|ГДЕ
	|	уатЗаправкаГСМЗаправки.Ссылка = &Ссылка";
	Запрос.Текст=ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ГруппаГСМТЖ", Перечисления.уатГруппыГСМ.ПрисадкиИТехническиеЖидкости);
	
	тблТЖ = Запрос.Выполнить().Выгрузить();
	
	тблТЖ.Колонки.Добавить("ВидДвижения");
	тблТЖ.Колонки.Добавить("Партия");
	тблТЖ.Колонки.Добавить("Регистратор");
	тблТЖ.Колонки.Добавить("Стоимость");
	тблТЖ.Колонки.Добавить("СтоимостьУпр");
	тблТЖ.Колонки.Дата.Имя = "Период";
	
	УчетнаяПолитика = уатОбщегоНазначения.УчетнаяПолитика(ДокументСсылка.Организация, ДокументСсылка.Дата);
	Если УчетнаяПолитика.СпособОценкиМПЗ <> Перечисления.СпособыОценки.ПоСредней Тогда
		ТекПартия = ДокументСсылка;
	Иначе
		ТекПартия = Неопределено;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из тблТЖ Цикл
		ТекСтрока.Регистратор = ДокументСсылка;
		ТекСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
		ТекСтрока.Партия = ТекПартия;
		
		КурсКратностьВалютыСтроки = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(
			ТекСтрока.Валюта, ТекСтрока.ДатаЗаправки, ДокументСсылка);
		КурсКратностьВалютыРегл = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(
			СтруктураДополнительныеСвойства.ВалютаРеглУчета, ТекСтрока.ДатаЗаправки, ДокументСсылка);
		КурсКратностьВалютыУпр = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(
			СтруктураДополнительныеСвойства.ВалютаУпрУчета,	ТекСтрока.ДатаЗаправки, ДокументСсылка);
			
		ТекСтрока.Стоимость = ТекСтрока.Сумма;
		ТекСтрока.СтоимостьУпр = ТекСтрока.Сумма;
		
		Если ТекСтрока.Стоимость <> 0 И ТекСтрока.Валюта <> СтруктураДополнительныеСвойства.ВалютаРеглУчета Тогда
			ТекСтрока.Стоимость = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Стоимость,
				ТекСтрока.Валюта,                    СтруктураДополнительныеСвойства.ВалютаРеглУчета,
				КурсКратностьВалютыСтроки.Курс,      КурсКратностьВалютыРегл.Курс,
				КурсКратностьВалютыСтроки.Кратность, КурсКратностьВалютыРегл.Кратность,,
				ДокументСсылка);
		КонецЕсли;
		Если ТекСтрока.СтоимостьУпр <> 0 И ТекСтрока.Валюта <> СтруктураДополнительныеСвойства.ВалютаУпрУчета Тогда
			ТекСтрока.СтоимостьУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СтоимостьУпр,
				ТекСтрока.Валюта,                    СтруктураДополнительныеСвойства.ВалютаУпрУчета,
				КурсКратностьВалютыСтроки.Курс,      КурсКратностьВалютыУпр.Курс,
				КурсКратностьВалютыСтроки.Кратность, КурсКратностьВалютыУпр.Кратность,,
				ДокументСсылка);
		КонецЕсли;
		Если ТекСтрока.СуммаНДС <> 0 И ТекСтрока.Валюта <> СтруктураДополнительныеСвойства.ВалютаРеглУчета Тогда
			ТекСтрока.СуммаНДС = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаНДС,
				ТекСтрока.Валюта,                    СтруктураДополнительныеСвойства.ВалютаРеглУчета,
				КурсКратностьВалютыСтроки.Курс,      КурсКратностьВалютыРегл.Курс,
				КурсКратностьВалютыСтроки.Кратность, КурсКратностьВалютыРегл.Кратность,,
				ДокументСсылка);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартииТЖ", тблТЖ);
	
КонецПроцедуры // СформироватьТаблицаТЖ()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаОборотыГСМ(ДокументСсылка, СтруктураДополнительныеСвойства)
	// получим результат запроса по таблице ГСМ
	Запрос = Новый Запрос();
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатЗаправкаГСМЗаправки.Ссылка КАК Регистратор,
	|	ВЫБОР
	|		КОГДА уатЗаправкаГСМЗаправки.ПутевойЛист <> ЗНАЧЕНИЕ(Документ.уатПутевойЛист.ПустаяСсылка)
	|				И уатЗаправкаГСМЗаправки.Дата < уатЗаправкаГСМЗаправки.ПутевойЛист.ДатаВыезда
	|			ТОГДА уатЗаправкаГСМЗаправки.ПутевойЛист.ДатаВыезда
	|		ИНАЧЕ ВЫБОР
	|				КОГДА уатЗаправкаГСМЗаправки.ПутевойЛист <> ЗНАЧЕНИЕ(Документ.уатПутевойЛист.ПустаяСсылка)
	|						И уатЗаправкаГСМЗаправки.ПутевойЛист.ДатаВозвращения <> ДАТАВРЕМЯ(1, 1, 1)
	|						И уатЗаправкаГСМЗаправки.Дата > уатЗаправкаГСМЗаправки.ПутевойЛист.ДатаВозвращения
	|					ТОГДА уатЗаправкаГСМЗаправки.ПутевойЛист.ДатаВозвращения
	|				ИНАЧЕ уатЗаправкаГСМЗаправки.Дата
	|			КОНЕЦ
	|	КОНЕЦ КАК Период,
	|	уатЗаправкаГСМЗаправки.Дата КАК ДатаЗаправки,
	|	уатЗаправкаГСМЗаправки.Ссылка.Колонна КАК Колонна,
	|	уатЗаправкаГСМЗаправки.ТС КАК ТС,
	|	ВЫБОР
	|		КОГДА уатНоменклатураГСМ.ГруппаГСМ = ЗНАЧЕНИЕ(Перечисление.уатГруппыГСМ.Талон)
	|			ТОГДА уатЗаправкаГСМЗаправки.ГСМ
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК НоменклатураТалонов,
	|	ВЫБОР
	|		КОГДА уатНоменклатураГСМ.ГруппаГСМ = ЗНАЧЕНИЕ(Перечисление.уатГруппыГСМ.Талон)
	|			ТОГДА уатНоменклатураГСМ.ГСМТалона
	|		ИНАЧЕ уатЗаправкаГСМЗаправки.ГСМ
	|	КОНЕЦ КАК ГСМ,
	|	уатНоменклатураГСМ.ГруппаГСМ КАК ГруппаГСМ,
	|	уатЗаправкаГСМЗаправки.Ссылка.АЗС КАК АЗС,
	|	уатЗаправкаГСМЗаправки.Ссылка.ВидДвиженияГСМ КАК ВидЗаправки,
	|	уатЗаправкаГСМЗаправки.Водитель КАК Водитель,
	|	уатЗаправкаГСМЗаправки.ПластиковаяКарта КАК ПластиковаяКарта,
	|	ВЫБОР
	|		КОГДА уатЗаправкаГСМЗаправки.Ссылка.ВидДвиженияГСМ = ЗНАЧЕНИЕ(Перечисление.уатВидыДвиженияГСМ.ЗаправкаСклад)
	|				ИЛИ уатЗаправкаГСМЗаправки.Ссылка.ВидДвиженияГСМ = ЗНАЧЕНИЕ(Перечисление.уатВидыДвиженияГСМ.ЗаправкаПластиковаяКартаСклад)
	|				ИЛИ уатЗаправкаГСМЗаправки.Ссылка.ВидДвиженияГСМ = ЗНАЧЕНИЕ(Перечисление.уатВидыДвиженияГСМ.ЗаправкаТалоны)
	|			ТОГДА уатЗаправкаГСМЗаправки.Сумма + уатЗаправкаГСМЗаправки.СуммаНДС
	|		КОГДА уатЗаправкаГСМЗаправки.Ссылка.УчитыватьНДС И НЕ уатЗаправкаГСМЗаправки.Ссылка.СуммаВключаетНДС
	|			ТОГДА уатЗаправкаГСМЗаправки.Сумма + уатЗаправкаГСМЗаправки.СуммаНДС
	|		ИНАЧЕ уатЗаправкаГСМЗаправки.Сумма
	|	КОНЕЦ КАК Стоимость,
	|	ВЫБОР
	|		КОГДА уатЗаправкаГСМЗаправки.Ссылка.ВидДвиженияГСМ = ЗНАЧЕНИЕ(Перечисление.уатВидыДвиженияГСМ.ЗаправкаСклад)
	|				ИЛИ уатЗаправкаГСМЗаправки.Ссылка.ВидДвиженияГСМ = ЗНАЧЕНИЕ(Перечисление.уатВидыДвиженияГСМ.ЗаправкаПластиковаяКартаСклад)
	|				ИЛИ уатЗаправкаГСМЗаправки.Ссылка.ВидДвиженияГСМ = ЗНАЧЕНИЕ(Перечисление.уатВидыДвиженияГСМ.ЗаправкаТалоны)
	|			ТОГДА уатЗаправкаГСМЗаправки.Сумма + уатЗаправкаГСМЗаправки.СуммаНДС
	|		КОГДА уатЗаправкаГСМЗаправки.Ссылка.УчитыватьНДС И НЕ уатЗаправкаГСМЗаправки.Ссылка.СуммаВключаетНДС
	|			ТОГДА уатЗаправкаГСМЗаправки.Сумма + уатЗаправкаГСМЗаправки.СуммаНДС
	|		ИНАЧЕ уатЗаправкаГСМЗаправки.Сумма
	|	КОНЕЦ КАК СтоимостьУпр,
	|	уатЗаправкаГСМЗаправки.СуммаНДС КАК СуммаНДС,
	|	уатЗаправкаГСМЗаправки.Валюта КАК Валюта,
	|	уатЗаправкаГСМЗаправки.Ссылка.Организация КАК Организация,
	|	уатЗаправкаГСМЗаправки.Ссылка.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	уатЗаправкаГСМЗаправки.ПутевойЛист КАК ПутевойЛист,
	|	уатЗаправкаГСМЗаправки.НомераТалонов,
	|	уатЗаправкаГСМЗаправки.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА уатНоменклатураГСМ.ГруппаГСМ = ЗНАЧЕНИЕ(Перечисление.уатГруппыГСМ.Талон)
	|			ТОГДА уатЗаправкаГСМЗаправки.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоТалонов
	|ИЗ
	|	Документ.уатЗаправкаГСМ.Заправки КАК уатЗаправкаГСМЗаправки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
	|		ПО уатЗаправкаГСМЗаправки.ГСМ = уатНоменклатураГСМ.Номенклатура
	|ГДЕ
	|	уатЗаправкаГСМЗаправки.Ссылка = &Ссылка";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	тблГСМ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекСтрока Из тблГСМ Цикл
		Если ТекСтрока.ГруппаГСМ = Перечисления.уатГруппыГСМ.Талон Тогда
			ТекСтрока.Количество = уатОбщегоНазначения.уатКоличествоЛитровТалонаГСМ(ТекСтрока.Период, ТекСтрока.АЗС,
				ТекСтрока.НоменклатураТалонов, ТекСтрока.Количество);
		КонецЕсли;
		
		КурсКратностьВалютыСтроки = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(
			ТекСтрока.Валюта, ТекСтрока.ДатаЗаправки, ДокументСсылка);
		КурсКратностьВалютыРегл = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(
			СтруктураДополнительныеСвойства.ВалютаРеглУчета, ТекСтрока.ДатаЗаправки, ДокументСсылка);
		КурсКратностьВалютыУпр = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(
			СтруктураДополнительныеСвойства.ВалютаУпрУчета,	ТекСтрока.ДатаЗаправки, ДокументСсылка);
			
		Если ТекСтрока.Стоимость <> 0 И ТекСтрока.Валюта <> СтруктураДополнительныеСвойства.ВалютаРеглУчета Тогда
			ТекСтрока.Стоимость = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Стоимость,
				ТекСтрока.Валюта,                    СтруктураДополнительныеСвойства.ВалютаРеглУчета,
				КурсКратностьВалютыСтроки.Курс,      КурсКратностьВалютыРегл.Курс,
				КурсКратностьВалютыСтроки.Кратность, КурсКратностьВалютыРегл.Кратность,,
				ДокументСсылка);
		КонецЕсли;
		Если ТекСтрока.СтоимостьУпр <> 0 И ТекСтрока.Валюта <> СтруктураДополнительныеСвойства.ВалютаУпрУчета Тогда
			ТекСтрока.СтоимостьУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СтоимостьУпр,
				ТекСтрока.Валюта,                    СтруктураДополнительныеСвойства.ВалютаУпрУчета,
				КурсКратностьВалютыСтроки.Курс,      КурсКратностьВалютыУпр.Курс,
				КурсКратностьВалютыСтроки.Кратность, КурсКратностьВалютыУпр.Кратность,,
				ДокументСсылка);
		КонецЕсли;
		Если ТекСтрока.СуммаНДС <> 0 И ТекСтрока.Валюта <> СтруктураДополнительныеСвойства.ВалютаРеглУчета тогда
			ТекСтрока.СуммаНДС = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаНДС,
				ТекСтрока.Валюта,                    СтруктураДополнительныеСвойства.ВалютаРеглУчета,
				КурсКратностьВалютыСтроки.Курс,      КурсКратностьВалютыРегл.Курс,
				КурсКратностьВалютыСтроки.Кратность, КурсКратностьВалютыРегл.Кратность,,
				ДокументСсылка);
		КонецЕсли;
	КонецЦикла;
	
	// проставляем колонну, если не заполнена
	Если НЕ ЗначениеЗаполнено(ДокументСсылка.Колонна) Тогда
		Для Каждого ТекСтрока Из тблГСМ Цикл
			ТекСтрока.Колонна = уатОбщегоНазначения.МестонахождениеТС(ТекСтрока.ТС, ТекСтрока.Период).Колонна;
		КонецЦикла;
	КонецЕсли;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОборотыПоЗаправкамГСМ", тблГСМ);
	
КонецПроцедуры // СформироватьТаблицаОборотыГСМ()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаОборотыТЖ(ДокументСсылка, СтруктураДополнительныеСвойства)
	// получим результат запроса по таблице ГСМ
	Запрос = Новый Запрос();
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатЗаправкаГСМЗаправки.Ссылка КАК Регистратор,
	|	ВЫБОР
	|		КОГДА уатЗаправкаГСМЗаправки.ПутевойЛист <> ЗНАЧЕНИЕ(Документ.уатПутевойЛист.ПустаяСсылка)
	|				И уатЗаправкаГСМЗаправки.Дата < уатЗаправкаГСМЗаправки.ПутевойЛист.ДатаВыезда
	|			ТОГДА уатЗаправкаГСМЗаправки.ПутевойЛист.ДатаВыезда
	|		ИНАЧЕ ВЫБОР
	|				КОГДА уатЗаправкаГСМЗаправки.ПутевойЛист <> ЗНАЧЕНИЕ(Документ.уатПутевойЛист.ПустаяСсылка)
	|						И уатЗаправкаГСМЗаправки.ПутевойЛист.ДатаВозвращения <> ДАТАВРЕМЯ(1, 1, 1)
	|						И уатЗаправкаГСМЗаправки.Дата > уатЗаправкаГСМЗаправки.ПутевойЛист.ДатаВозвращения
	|					ТОГДА уатЗаправкаГСМЗаправки.ПутевойЛист.ДатаВозвращения
	|				ИНАЧЕ уатЗаправкаГСМЗаправки.Дата
	|			КОНЕЦ
	|	КОНЕЦ КАК Период,
	|	уатЗаправкаГСМЗаправки.Ссылка.Колонна КАК Колонна,
	|	уатЗаправкаГСМЗаправки.ТС КАК ТС,
	|	уатЗаправкаГСМЗаправки.ГСМ КАК ГСМ,
	|	ЗНАЧЕНИЕ(Перечисление.уатВидыОперацийСТехническимиЖидкостями.ДоливПоАкту) КАК ВидОперации,
	|	уатЗаправкаГСМЗаправки.Водитель КАК Водитель,
	|	уатЗаправкаГСМЗаправки.Ссылка.Организация КАК Организация,
	|	уатЗаправкаГСМЗаправки.Количество КАК КоличествоПриход
	|ИЗ
	|	Документ.уатЗаправкаГСМ.Заправки КАК уатЗаправкаГСМЗаправки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
	|		ПО уатЗаправкаГСМЗаправки.ГСМ = уатНоменклатураГСМ.Номенклатура
	|			И (уатНоменклатураГСМ.ВестиУчетОстатковТЖ)
	|			И (уатНоменклатураГСМ.ГруппаГСМ = ЗНАЧЕНИЕ(Перечисление.уатГруппыГСМ.ПрисадкиИТехническиеЖидкости))
	|ГДЕ
	|	уатЗаправкаГСМЗаправки.Ссылка = &Ссылка";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	тблТЖ = Запрос.Выполнить().Выгрузить();
	
	// проставляем колонну, если не заполнена
	Если НЕ ЗначениеЗаполнено(ДокументСсылка.Колонна) Тогда
		Для Каждого ТекСтрока Из тблТЖ Цикл
			ТекСтрока.Колонна = уатОбщегоНазначения.МестонахождениеТС(ТекСтрока.ТС, ТекСтрока.Период).Колонна;
		КонецЦикла;
	КонецЕсли;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОборотыТЖ", тблТЖ);
	
КонецПроцедуры // СформироватьТаблицаОборотыТЖ()

#КонецОбласти

#КонецЕсли
